atmBoundaryLayerRANS/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    object          blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;


x1 -300;
x2 700;
y1 -1;
y2 1;
z1 0;
z2 500;

vertices
(
    ( $x1  $y1   $z1 ) // 0
    ( $x2  $y1   $z1 ) // 1
    ( $x2  $y2   $z1 ) // 2
    ( $x1  $y2   $z1 ) // 3
    ( $x1  $y1   $z2 ) // 4
    ( $x2  $y1   $z2 ) // 5
    ( $x2  $y2   $z2 ) // 6
    ( $x1  $y2   $z2 ) // 7
    
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (500 1 200) simpleGrading (1 1 20)
);

edges
(
);

boundary
(
    outlet
    {
        type patch;
        faces
        (
            (1 5 6 2)
        );
    }
    north
    {
        type empty;
        faces
        (
            (3 7 6 2)
        );
    }

    south
    {
        type empty;
        faces
        (
            (1 5 4 0)
        );
    }
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    ground
    {
        type wall;
        faces
        (
             (0 3 2 1)
        );
    }
    sky
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);


// ************************************************************************* //
