atmBoundaryLayerRANS/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 0;
    }

    outlet
    {
        type            calculated;
        value           uniform 0;
    }

    forest
    {
        type            nutkAtmRoughWallFunction;
        z0              uniform 0.06;
        value           uniform 0.0;
    }

    ground
    {
        type            nutkAtmRoughWallFunction;
        z0              uniform 0.06;
        value           uniform 0.0;
    }

    sky
    {
        type slip;
    }

    north
    {
        type empty;
    }

    south
    {
        type empty;
    }
}


// ************************************************************************* //
