atmBoundaryLayerRANS/system/singleGraph
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes graph data for specified fields along a line, specified by start
    and end points.

\*---------------------------------------------------------------------------*/
// run: postProcess -func singleGraph -latestTime
/*---------------------------------------------------------------------------*/

start   (-295 0 0);
end     (-295 0 500);
nPoints 1000;

fields  (U k epsilon);

axis    distance; // The independent variable of the graph. Can be "x",
                 // "y", "z", "xyz" (all coordinates written out), or
                 // "distance" (from the start point).

#includeEtc "caseDicts/postProcessing/graphs/graphUniform.cfg"
// ************************************************************************* //

